avrdudes/avr-libc/include/avr/ioavr128da64s.h
/* Event Output C select bit group configurations*/
typedef enum PORTMUX_EVOUTC_enum
{
    PORTMUX_EVOUTC_DEFAULT_gc      = (PORTMUX_EVOUTC_DEFAULT_gv << PORTMUX_EVOUTC_bp),  /* EVOUT: PC2 */
    PORTMUX_EVOUTC_ALT1_gc         = (PORTMUX_EVOUTC_ALT1_gv << PORTMUX_EVOUTC_bp)   /* EVOUT: PC7 */
} PORTMUX_EVOUTC_t;

/* Event Output D select bit group values */
typedef enum PORTMUX_EVOUTD_VALUES_enum
{
    PORTMUX_EVOUTD_DEFAULT_gv      = 0x00,  /* EVOUT: PD2 */
    PORTMUX_EVOUTD_ALT1_gv         = 0x01   /* EVOUT: PD7 */
} PORTMUX_EVOUTD_values_t;

/* Event Output D select bit group configurations*/
typedef enum PORTMUX_EVOUTD_enum
{
    PORTMUX_EVOUTD_DEFAULT_gc      = (PORTMUX_EVOUTD_DEFAULT_gv << PORTMUX_EVOUTD_bp),  /* EVOUT: PD2 */
    PORTMUX_EVOUTD_ALT1_gc         = (PORTMUX_EVOUTD_ALT1_gv << PORTMUX_EVOUTD_bp)   /* EVOUT: PD7 */
} PORTMUX_EVOUTD_t;

/* Event Output E select bit group values */
typedef enum PORTMUX_EVOUTE_VALUES_enum
{
    PORTMUX_EVOUTE_DEFAULT_gv      = 0x00,  /* EVOUT: PE2 */
    PORTMUX_EVOUTE_ALT1_gv         = 0x01   /* EVOUT: PE7 */
} PORTMUX_EVOUTE_values_t;

/* Event Output E select bit group configurations*/
typedef enum PORTMUX_EVOUTE_enum
{
    PORTMUX_EVOUTE_DEFAULT_gc      = (PORTMUX_EVOUTE_DEFAULT_gv << PORTMUX_EVOUTE_bp),  /* EVOUT: PE2 */
    PORTMUX_EVOUTE_ALT1_gc         = (PORTMUX_EVOUTE_ALT1_gv << PORTMUX_EVOUTE_bp)   /* EVOUT: PE7 */
} PORTMUX_EVOUTE_t;

/* Event Output F select bit group values */
typedef enum PORTMUX_EVOUTF_VALUES_enum
{
    PORTMUX_EVOUTF_DEFAULT_gv      = 0x00   /* EVOUT: PF2 */
} PORTMUX_EVOUTF_values_t;

/* Event Output F select bit group configurations*/
typedef enum PORTMUX_EVOUTF_enum
{
    PORTMUX_EVOUTF_DEFAULT_gc      = (PORTMUX_EVOUTF_DEFAULT_gv << PORTMUX_EVOUTF_bp)   /* EVOUT: PF2 */
} PORTMUX_EVOUTF_t;

/* Event Output G select bit group values */
typedef enum PORTMUX_EVOUTG_VALUES_enum
{
    PORTMUX_EVOUTG_DEFAULT_gv      = 0x00,  /* EVOUT: PG2 */
    PORTMUX_EVOUTG_ALT1_gv         = 0x01   /* EVOUT: PG7 */
} PORTMUX_EVOUTG_values_t;

/* Event Output G select bit group configurations*/
typedef enum PORTMUX_EVOUTG_enum
{
    PORTMUX_EVOUTG_DEFAULT_gc      = (PORTMUX_EVOUTG_DEFAULT_gv << PORTMUX_EVOUTG_bp),  /* EVOUT: PG2 */
    PORTMUX_EVOUTG_ALT1_gc         = (PORTMUX_EVOUTG_ALT1_gv << PORTMUX_EVOUTG_bp)   /* EVOUT: PG7 */
} PORTMUX_EVOUTG_t;

/* CCL Look-Up Table 0 Signals select bit group values */
typedef enum PORTMUX_LUT0_VALUES_enum
{
    PORTMUX_LUT0_DEFAULT_gv        = 0x00,  /* In: PA0, PA1, PA2 Out: PA3 */
    PORTMUX_LUT0_ALT1_gv           = 0x01   /* In: PA0, PA1, PA2 Out: PA6 */
} PORTMUX_LUT0_values_t;

/* CCL Look-Up Table 0 Signals select bit group configurations*/
typedef enum PORTMUX_LUT0_enum
{
    PORTMUX_LUT0_DEFAULT_gc        = (PORTMUX_LUT0_DEFAULT_gv << PORTMUX_LUT0_bp),  /* In: PA0, PA1, PA2 Out: PA3 */
    PORTMUX_LUT0_ALT1_gc           = (PORTMUX_LUT0_ALT1_gv << PORTMUX_LUT0_bp)   /* In: PA0, PA1, PA2 Out: PA6 */
} PORTMUX_LUT0_t;

/* CCL Look-Up Table 1 Signals select bit group values */
typedef enum PORTMUX_LUT1_VALUES_enum
{
    PORTMUX_LUT1_DEFAULT_gv        = 0x00,  /* In: PC0, PC1, PC2 Out: PC3 */
    PORTMUX_LUT1_ALT1_gv           = 0x01   /* In: PC0, PC1, PC2 Out: PC6 */
} PORTMUX_LUT1_values_t;

/* CCL Look-Up Table 1 Signals select bit group configurations*/
typedef enum PORTMUX_LUT1_enum
{
    PORTMUX_LUT1_DEFAULT_gc        = (PORTMUX_LUT1_DEFAULT_gv << PORTMUX_LUT1_bp),  /* In: PC0, PC1, PC2 Out: PC3 */
    PORTMUX_LUT1_ALT1_gc           = (PORTMUX_LUT1_ALT1_gv << PORTMUX_LUT1_bp)   /* In: PC0, PC1, PC2 Out: PC6 */
} PORTMUX_LUT1_t;

/* CCL Look-Up Table 2 Signals select bit group values */
typedef enum PORTMUX_LUT2_VALUES_enum
{
    PORTMUX_LUT2_DEFAULT_gv        = 0x00,  /* In: PD0, PD1, PD2 Out: PD3 */
    PORTMUX_LUT2_ALT1_gv           = 0x01   /* In: PD0, PD1, PD2 Out: PD6 */
} PORTMUX_LUT2_values_t;

/* CCL Look-Up Table 2 Signals select bit group configurations*/
typedef enum PORTMUX_LUT2_enum
{
    PORTMUX_LUT2_DEFAULT_gc        = (PORTMUX_LUT2_DEFAULT_gv << PORTMUX_LUT2_bp),  /* In: PD0, PD1, PD2 Out: PD3 */
    PORTMUX_LUT2_ALT1_gc           = (PORTMUX_LUT2_ALT1_gv << PORTMUX_LUT2_bp)   /* In: PD0, PD1, PD2 Out: PD6 */
} PORTMUX_LUT2_t;

/* CCL Look-Up Table 3 Signals select bit group values */
typedef enum PORTMUX_LUT3_VALUES_enum
{
    PORTMUX_LUT3_DEFAULT_gv        = 0x00   /* In: PF0, PF1, PF2 Out: PF3 */
} PORTMUX_LUT3_values_t;

/* CCL Look-Up Table 3 Signals select bit group configurations*/
typedef enum PORTMUX_LUT3_enum
{
    PORTMUX_LUT3_DEFAULT_gc        = (PORTMUX_LUT3_DEFAULT_gv << PORTMUX_LUT3_bp)   /* In: PF0, PF1, PF2 Out: PF3 */
} PORTMUX_LUT3_t;

/* CCL Look-Up Table 4 Signals select bit group values */
typedef enum PORTMUX_LUT4_VALUES_enum
{
    PORTMUX_LUT4_DEFAULT_gv        = 0x00,  /* In: PB0, PB1, PB2 Out: PB3 */
    PORTMUX_LUT4_ALT1_gv           = 0x01   /* In: PB0, PB1, PB2 Out: PB6 */
} PORTMUX_LUT4_values_t;

/* CCL Look-Up Table 4 Signals select bit group configurations*/
typedef enum PORTMUX_LUT4_enum
{
    PORTMUX_LUT4_DEFAULT_gc        = (PORTMUX_LUT4_DEFAULT_gv << PORTMUX_LUT4_bp),  /* In: PB0, PB1, PB2 Out: PB3 */
    PORTMUX_LUT4_ALT1_gc           = (PORTMUX_LUT4_ALT1_gv << PORTMUX_LUT4_bp)   /* In: PB0, PB1, PB2 Out: PB6 */
} PORTMUX_LUT4_t;

/* CCL Look-Up Table 5 Signals select bit group values */
typedef enum PORTMUX_LUT5_VALUES_enum
{
    PORTMUX_LUT5_DEFAULT_gv        = 0x00,  /* In: PG0, PG1, PG2 Out: PG3 */
    PORTMUX_LUT5_ALT1_gv           = 0x01   /* In: PG0, PG1, PG2 Out: PG6 */
} PORTMUX_LUT5_values_t;

/* CCL Look-Up Table 5 Signals select bit group configurations*/
typedef enum PORTMUX_LUT5_enum
{
    PORTMUX_LUT5_DEFAULT_gc        = (PORTMUX_LUT5_DEFAULT_gv << PORTMUX_LUT5_bp),  /* In: PG0, PG1, PG2 Out: PG3 */
    PORTMUX_LUT5_ALT1_gc           = (PORTMUX_LUT5_ALT1_gv << PORTMUX_LUT5_bp)   /* In: PG0, PG1, PG2 Out: PG6 */
} PORTMUX_LUT5_t;

/* SPI0 Signals select bit group values */
typedef enum PORTMUX_SPI0_VALUES_enum
{
    PORTMUX_SPI0_DEFAULT_gv        = 0x00,  /* MOSI: PA4, MISO: PA5, SCK: PA6, SS: PA7 */
    PORTMUX_SPI0_ALT1_gv           = 0x01,  /* MOSI: PE0, MISO: PE1, SCK: PE2, SS: PE3 */
    PORTMUX_SPI0_ALT2_gv           = 0x02,  /* MOSI: PG4, MISO: PG5, SCK: PG6, SS: PG7 */
    PORTMUX_SPI0_NONE_gv           = 0x03   /* Not connected to any pins */
} PORTMUX_SPI0_values_t;

/* SPI0 Signals select bit group configurations*/
typedef enum PORTMUX_SPI0_enum
{
    PORTMUX_SPI0_DEFAULT_gc        = (PORTMUX_SPI0_DEFAULT_gv << PORTMUX_SPI0_gp),  /* MOSI: PA4, MISO: PA5, SCK: PA6, SS: PA7 */
    PORTMUX_SPI0_ALT1_gc           = (PORTMUX_SPI0_ALT1_gv << PORTMUX_SPI0_gp),  /* MOSI: PE0, MISO: PE1, SCK: PE2, SS: PE3 */
    PORTMUX_SPI0_ALT2_gc           = (PORTMUX_SPI0_ALT2_gv << PORTMUX_SPI0_gp),  /* MOSI: PG4, MISO: PG5, SCK: PG6, SS: PG7 */
    PORTMUX_SPI0_NONE_gc           = (PORTMUX_SPI0_NONE_gv << PORTMUX_SPI0_gp)   /* Not connected to any pins */
} PORTMUX_SPI0_t;

/* SPI1 Signals select bit group values */
typedef enum PORTMUX_SPI1_VALUES_enum
{
    PORTMUX_SPI1_DEFAULT_gv        = 0x00,  /* MOSI: PC0, MISO: PC1, SCK: PC2, SS: PC3 */
    PORTMUX_SPI1_ALT1_gv           = 0x01,  /* MOSI: PC4, MISO: PC5, SCK: PC6, SS: PC7 */
    PORTMUX_SPI1_ALT2_gv           = 0x02,  /* MOSI: PB4, MISO: PB5, SCK: PB6, SS: PB7 */
    PORTMUX_SPI1_NONE_gv           = 0x03   /* Not connected to any pins */
} PORTMUX_SPI1_values_t;

/* SPI1 Signals select bit group configurations*/
typedef enum PORTMUX_SPI1_enum
{
    PORTMUX_SPI1_DEFAULT_gc        = (PORTMUX_SPI1_DEFAULT_gv << PORTMUX_SPI1_gp),  /* MOSI: PC0, MISO: PC1, SCK: PC2, SS: PC3 */
    PORTMUX_SPI1_ALT1_gc           = (PORTMUX_SPI1_ALT1_gv << PORTMUX_SPI1_gp),  /* MOSI: PC4, MISO: PC5, SCK: PC6, SS: PC7 */
    PORTMUX_SPI1_ALT2_gc           = (PORTMUX_SPI1_ALT2_gv << PORTMUX_SPI1_gp),  /* MOSI: PB4, MISO: PB5, SCK: PB6, SS: PB7 */
    PORTMUX_SPI1_NONE_gc           = (PORTMUX_SPI1_NONE_gv << PORTMUX_SPI1_gp)   /* Not connected to any pins */
} PORTMUX_SPI1_t;

